package com.wcpdoc.exam.core.test;

import java.util.Date;
import java.util.concurrent.TimeUnit;

import org.apache.commons.lang3.RandomUtils;
import org.springframework.stereotype.Component;

import com.wcpdoc.core.exception.MyException;
import com.wcpdoc.core.util.DateUtil;
import com.wcpdoc.exam.core.cache.AutoMarkCache;

/**
 * ehcache读写锁测试
 * 
 * 当一个线程取得某一缓存key的read锁之后
 * 此线程不可以取得该key的write锁(即此线程不能写入该key的值);
 * 其他线程可以取得该key的read锁, 但不能取得write锁(即其他线程可以读取该key的值, 但不能写入). 
 * 	要等到该线程(或所有线程)释放该key的read锁后, 才能获得write锁
 * 
 * 当一个线程取得某一缓存key的write锁之后
 * 此线程可以取得该key的read锁(即此线程可以读取该key的值);
 * 其他线程不可以取得该key的read锁和write锁(即其他线程不能读取或写入该key的值). 
 * 要等到该线程释放该key的write锁后才能获得
 * 
 * v1.0 zhanghc 2022年4月14日下午4:40:22
 */
@Component
public class EhcacheReadWriteLockTest {
	private static final int examId = -1;
	
	public void run() {
		AutoMarkCache.put(examId, null);

		String[] userNames = new String[] { "张虎成", "陈云云", "车永强" };
		EhcacheReadWriteLockTest lockTest = new EhcacheReadWriteLockTest();
		for (int i= 0; i < 3; i++) {// 和同方法竞争
			new Thread(new Runnable() {
				public void run() {
					while (true) {
						lockTest.answer(userNames[RandomUtils.nextInt(0, 3)]);// 和不同方法竞争
					}
				}
			}).start();
			new Thread(new Runnable() {
				public void run() {
					while (true) {
						lockTest.updateExamTime(userNames[RandomUtils.nextInt(0, 2)]);// 和不同方法竞争
					}
				}
			}).start();
			new Thread(new Runnable() {
				public void run() {
					while (true) {
						lockTest.autoMark(userNames[RandomUtils.nextInt(0, 2)]);// 和不同方法竞争
					}
				}
			}).start();
		}
	}
	
	public void answer(String userName) {
		Date t1 = new Date();
		try {
			System.err.println(String.format("%s:%s:%s:答题尝试加读锁", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS")));
			if (!AutoMarkCache.tryReadLock(examId, 5000)) {
				Date t2 = new Date();
				System.err.println(String.format("%s:%s:%s:答题尝试加读锁失败，耗时%s毫秒", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), t2.getTime() - t1.getTime()));
				return;
			}
		} catch (InterruptedException e) {
			throw new MyException(String.format("%s:%s:%s:答题异常，%s", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), e.getMessage()));
		}
		try {
			Date t2 = new Date();
			System.err.println(String.format("%s:%s:%s:答题开始，读锁耗时%s", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), t2.getTime() - t1.getTime()));
			TimeUnit.MILLISECONDS.sleep(RandomUtils.nextInt(800, 1500));
			Date t3 = new Date();
			System.err.println(String.format("%s:%s:%s:答题完成，答题耗时%s毫秒", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), t3.getTime() - t2.getTime()));
		} catch (Exception e) {
			throw new MyException(String.format("%s:%s:%s:答题异常，%s", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), e.getMessage()));
		} finally {
			AutoMarkCache.releaseReadLock(examId);
		}
	}
	
	public void updateExamTime(String userName) {
		Date t1 = new Date();
		try {
			System.err.println(String.format("%s:%s:%s:变更时间尝试加写锁", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS")));
			if (!AutoMarkCache.tryWriteLock(examId, 5000)) {
				Date t2 = new Date();
				System.err.println(String.format("%s:%s:%s:变更时间尝试加写锁失败，耗时%s毫秒", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), t2.getTime() - t1.getTime()));
				return;
			}
		} catch (InterruptedException e) {
			throw new MyException(String.format("%s:%s:%s:变更时间异常，%s", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), e.getMessage()));
		}
		try {
			Date t2 = new Date();
			System.err.println(String.format("%s:%s:%s:变更时间开始，写锁耗时%s", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), t2.getTime() - t1.getTime()));
			TimeUnit.MILLISECONDS.sleep(RandomUtils.nextInt(1000, 3000));
			Date t3 = new Date();
			System.err.println(String.format("%s:%s:%s:变更时间完成，耗时%s", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), t3.getTime() - t2.getTime()));
		} catch (Exception e) {
			throw new MyException(String.format("%s:%s:%s:变更时间异常，%s", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), e.getMessage()));
		} finally {
			AutoMarkCache.releaseWriteLock(examId);
		}
	}
	
	public void autoMark(String userName) {
		Date t1 = new Date();
		try {
			System.err.println(String.format("%s:%s:%s:自动阅卷尝试加写锁", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS")));
			if (!AutoMarkCache.tryWriteLock(examId, 5000)) {
				Date t2 = new Date();
				System.err.println(String.format("%s:%s:%s:自动阅卷尝试加写锁失败，耗时%s毫秒", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), t2.getTime() - t1.getTime()));
				return;
			}
		} catch (InterruptedException e) {
			throw new MyException(String.format("%s:%s:%s:自动阅卷异常，%s", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), e.getMessage()));
		}
		try {
			Date t2 = new Date();
			System.err.println(String.format("%s:%s:%s:自动阅卷开始，写锁耗时%s", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), t2.getTime() - t1.getTime()));
			TimeUnit.MILLISECONDS.sleep(RandomUtils.nextInt(1000, 3000));
			Date t3 = new Date();
			System.err.println(String.format("%s:%s:%s:自动阅卷完成，耗时%s", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), t3.getTime() - t2.getTime()));
		} catch (Exception e) {
			throw new MyException(String.format("%s:%s:%s:自动阅卷异常，%s", userName, Thread.currentThread().getId(), DateUtil.formatDateCustom(new Date(), "yyyy-MM-dd HH:mm:ss.SSS"), e.getMessage()));
		} finally {
			AutoMarkCache.releaseWriteLock(examId);
		}
	}
	
	/**
	 * 某次运行结果
	 * 
		张虎成:69:2022-04-14 11:24:01.953:自动阅卷尝试加写锁
		张虎成:69:2022-04-14 11:24:01.968:自动阅卷开始，写锁耗时15
		张虎成:74:2022-04-14 11:24:01.953:变更时间尝试加写锁
		张虎成:67:2022-04-14 11:24:01.953:答题尝试加读锁
		陈云云:73:2022-04-14 11:24:01.953:答题尝试加读锁
		张虎成:68:2022-04-14 11:24:01.953:变更时间尝试加写锁
		车永强:70:2022-04-14 11:24:01.953:答题尝试加读锁
		陈云云:75:2022-04-14 11:24:01.953:自动阅卷尝试加写锁
		张虎成:72:2022-04-14 11:24:01.953:自动阅卷尝试加写锁
		张虎成:71:2022-04-14 11:24:01.953:变更时间尝试加写锁
		张虎成:69:2022-04-14 11:24:03.593:自动阅卷完成，耗时1625
		张虎成:69:2022-04-14 11:24:03.593:自动阅卷尝试加写锁
		张虎成:69:2022-04-14 11:24:03.593:自动阅卷开始，写锁耗时0
		张虎成:69:2022-04-14 11:24:05.906:自动阅卷完成，耗时2313
		张虎成:74:2022-04-14 11:24:05.906:变更时间开始，写锁耗时3953
		陈云云:69:2022-04-14 11:24:05.906:自动阅卷尝试加写锁
		车永强:70:2022-04-14 11:24:06.968:答题尝试加读锁失败，耗时5015毫秒
		陈云云:70:2022-04-14 11:24:06.968:答题尝试加读锁
		张虎成:68:2022-04-14 11:24:06.968:变更时间尝试加写锁失败，耗时5015毫秒
		张虎成:68:2022-04-14 11:24:06.968:变更时间尝试加写锁
		陈云云:75:2022-04-14 11:24:06.968:自动阅卷尝试加写锁失败，耗时5015毫秒
		陈云云:75:2022-04-14 11:24:06.968:自动阅卷尝试加写锁
		陈云云:73:2022-04-14 11:24:06.968:答题尝试加读锁失败，耗时5015毫秒
		张虎成:72:2022-04-14 11:24:06.968:自动阅卷尝试加写锁失败，耗时5015毫秒
		张虎成:67:2022-04-14 11:24:06.968:答题尝试加读锁失败，耗时5015毫秒
		张虎成:72:2022-04-14 11:24:06.968:自动阅卷尝试加写锁
		张虎成:67:2022-04-14 11:24:06.968:答题尝试加读锁
		陈云云:73:2022-04-14 11:24:06.968:答题尝试加读锁
		张虎成:71:2022-04-14 11:24:06.968:变更时间尝试加写锁失败，耗时5015毫秒
		张虎成:71:2022-04-14 11:24:06.968:变更时间尝试加写锁
		张虎成:74:2022-04-14 11:24:08.562:变更时间完成，耗时2656
		张虎成:74:2022-04-14 11:24:08.562:变更时间尝试加写锁
		陈云云:69:2022-04-14 11:24:08.562:自动阅卷开始，写锁耗时2656
		陈云云:69:2022-04-14 11:24:11.250:自动阅卷完成，耗时2688
		陈云云:70:2022-04-14 11:24:11.250:答题开始，读锁耗时4282
		张虎成:69:2022-04-14 11:24:11.250:自动阅卷尝试加写锁
		张虎成:68:2022-04-14 11:24:11.968:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:68:2022-04-14 11:24:11.968:变更时间尝试加写锁
		陈云云:75:2022-04-14 11:24:11.968:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:75:2022-04-14 11:24:11.968:自动阅卷尝试加写锁
		陈云云:73:2022-04-14 11:24:11.968:答题尝试加读锁失败，耗时5000毫秒
		车永强:73:2022-04-14 11:24:11.968:答题尝试加读锁
		张虎成:72:2022-04-14 11:24:11.968:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:67:2022-04-14 11:24:11.968:答题尝试加读锁失败，耗时5000毫秒
		陈云云:72:2022-04-14 11:24:11.968:自动阅卷尝试加写锁
		张虎成:67:2022-04-14 11:24:11.968:答题尝试加读锁
		张虎成:67:2022-04-14 11:24:11.968:答题开始，读锁耗时0
		张虎成:71:2022-04-14 11:24:11.968:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:71:2022-04-14 11:24:11.968:变更时间尝试加写锁
		陈云云:70:2022-04-14 11:24:12.468:答题完成，答题耗时1218毫秒
		陈云云:70:2022-04-14 11:24:12.468:答题尝试加读锁
		张虎成:67:2022-04-14 11:24:12.906:答题完成，答题耗时938毫秒
		张虎成:74:2022-04-14 11:24:12.921:变更时间开始，写锁耗时4359
		车永强:67:2022-04-14 11:24:12.921:答题尝试加读锁
		张虎成:74:2022-04-14 11:24:14.750:变更时间完成，耗时1829
		张虎成:74:2022-04-14 11:24:14.750:变更时间尝试加写锁
		张虎成:74:2022-04-14 11:24:14.750:变更时间开始，写锁耗时0
		张虎成:69:2022-04-14 11:24:16.250:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:69:2022-04-14 11:24:16.250:自动阅卷尝试加写锁
		张虎成:68:2022-04-14 11:24:16.968:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:68:2022-04-14 11:24:16.968:变更时间尝试加写锁
		陈云云:75:2022-04-14 11:24:16.968:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:75:2022-04-14 11:24:16.968:自动阅卷尝试加写锁
		车永强:73:2022-04-14 11:24:16.968:答题尝试加读锁失败，耗时5000毫秒
		车永强:73:2022-04-14 11:24:16.968:答题尝试加读锁
		陈云云:72:2022-04-14 11:24:16.968:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:72:2022-04-14 11:24:16.968:自动阅卷尝试加写锁
		陈云云:71:2022-04-14 11:24:16.984:变更时间尝试加写锁失败，耗时5016毫秒
		张虎成:71:2022-04-14 11:24:16.984:变更时间尝试加写锁
		陈云云:70:2022-04-14 11:24:17.468:答题尝试加读锁失败，耗时5000毫秒
		车永强:70:2022-04-14 11:24:17.468:答题尝试加读锁
		张虎成:74:2022-04-14 11:24:17.640:变更时间完成，耗时2890
		车永强:67:2022-04-14 11:24:17.640:答题开始，读锁耗时4719
		陈云云:74:2022-04-14 11:24:17.640:变更时间尝试加写锁
		车永强:67:2022-04-14 11:24:18.640:答题完成，答题耗时1000毫秒
		陈云云:67:2022-04-14 11:24:18.640:答题尝试加读锁
		张虎成:69:2022-04-14 11:24:18.640:自动阅卷开始，写锁耗时2390
		张虎成:69:2022-04-14 11:24:20.750:自动阅卷完成，耗时2110
		陈云云:68:2022-04-14 11:24:20.750:变更时间开始，写锁耗时3782
		陈云云:69:2022-04-14 11:24:20.750:自动阅卷尝试加写锁
		陈云云:75:2022-04-14 11:24:21.968:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:75:2022-04-14 11:24:21.968:自动阅卷尝试加写锁
		车永强:73:2022-04-14 11:24:21.968:答题尝试加读锁失败，耗时5000毫秒
		车永强:73:2022-04-14 11:24:21.968:答题尝试加读锁
		张虎成:72:2022-04-14 11:24:21.968:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:72:2022-04-14 11:24:21.984:自动阅卷尝试加写锁
		张虎成:71:2022-04-14 11:24:21.984:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:71:2022-04-14 11:24:21.984:变更时间尝试加写锁
		车永强:70:2022-04-14 11:24:22.468:答题尝试加读锁失败，耗时5000毫秒
		车永强:70:2022-04-14 11:24:22.468:答题尝试加读锁
		陈云云:74:2022-04-14 11:24:22.640:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:74:2022-04-14 11:24:22.640:变更时间尝试加写锁
		陈云云:68:2022-04-14 11:24:22.812:变更时间完成，耗时2062
		张虎成:68:2022-04-14 11:24:22.812:变更时间尝试加写锁
		张虎成:68:2022-04-14 11:24:22.812:变更时间开始，写锁耗时0
		陈云云:67:2022-04-14 11:24:23.640:答题尝试加读锁失败，耗时5000毫秒
		陈云云:67:2022-04-14 11:24:23.640:答题尝试加读锁
		张虎成:68:2022-04-14 11:24:23.828:变更时间完成，耗时1016
		陈云云:69:2022-04-14 11:24:23.828:自动阅卷开始，写锁耗时3078
		陈云云:68:2022-04-14 11:24:23.828:变更时间尝试加写锁
		陈云云:69:2022-04-14 11:24:24.828:自动阅卷完成，耗时1000
		张虎成:69:2022-04-14 11:24:24.828:自动阅卷尝试加写锁
		张虎成:69:2022-04-14 11:24:24.828:自动阅卷开始，写锁耗时0
		张虎成:69:2022-04-14 11:24:26.875:自动阅卷完成，耗时2047
		张虎成:69:2022-04-14 11:24:26.875:自动阅卷尝试加写锁
		张虎成:69:2022-04-14 11:24:26.875:自动阅卷开始，写锁耗时0
		张虎成:75:2022-04-14 11:24:26.968:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:75:2022-04-14 11:24:26.968:自动阅卷尝试加写锁
		车永强:73:2022-04-14 11:24:26.984:答题尝试加读锁失败，耗时5016毫秒
		陈云云:73:2022-04-14 11:24:26.984:答题尝试加读锁
		张虎成:72:2022-04-14 11:24:26.984:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:72:2022-04-14 11:24:26.984:自动阅卷尝试加写锁
		陈云云:71:2022-04-14 11:24:26.984:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:71:2022-04-14 11:24:26.984:变更时间尝试加写锁
		车永强:70:2022-04-14 11:24:27.468:答题尝试加读锁失败，耗时5000毫秒
		车永强:70:2022-04-14 11:24:27.468:答题尝试加读锁
		陈云云:74:2022-04-14 11:24:27.640:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:74:2022-04-14 11:24:27.640:变更时间尝试加写锁
		陈云云:67:2022-04-14 11:24:28.640:答题尝试加读锁失败，耗时5000毫秒
		陈云云:67:2022-04-14 11:24:28.640:答题尝试加读锁
		陈云云:68:2022-04-14 11:24:28.828:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:68:2022-04-14 11:24:28.828:变更时间尝试加写锁
		张虎成:69:2022-04-14 11:24:29.500:自动阅卷完成，耗时2625
		陈云云:75:2022-04-14 11:24:29.500:自动阅卷开始，写锁耗时2532
		张虎成:69:2022-04-14 11:24:29.500:自动阅卷尝试加写锁
		陈云云:75:2022-04-14 11:24:31.890:自动阅卷完成，耗时2390
		张虎成:75:2022-04-14 11:24:31.890:自动阅卷尝试加写锁
		陈云云:73:2022-04-14 11:24:31.890:答题开始，读锁耗时4906
		陈云云:72:2022-04-14 11:24:31.984:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:72:2022-04-14 11:24:31.984:自动阅卷尝试加写锁
		车永强:70:2022-04-14 11:24:31.984:答题开始，读锁耗时4516
		张虎成:71:2022-04-14 11:24:31.984:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:71:2022-04-14 11:24:31.984:变更时间尝试加写锁
		张虎成:74:2022-04-14 11:24:32.640:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:67:2022-04-14 11:24:32.640:答题开始，读锁耗时4000
		张虎成:74:2022-04-14 11:24:32.640:变更时间尝试加写锁
		陈云云:73:2022-04-14 11:24:33.015:答题完成，答题耗时1125毫秒
		张虎成:73:2022-04-14 11:24:33.015:答题尝试加读锁
		车永强:70:2022-04-14 11:24:33.250:答题完成，答题耗时1266毫秒
		陈云云:70:2022-04-14 11:24:33.250:答题尝试加读锁
		陈云云:68:2022-04-14 11:24:33.828:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:68:2022-04-14 11:24:33.828:变更时间尝试加写锁
		陈云云:67:2022-04-14 11:24:34.015:答题完成，答题耗时1375毫秒
		张虎成:67:2022-04-14 11:24:34.015:答题尝试加读锁
		张虎成:69:2022-04-14 11:24:34.015:自动阅卷开始，写锁耗时4515
		张虎成:69:2022-04-14 11:24:35.796:自动阅卷完成，耗时1781
		张虎成:69:2022-04-14 11:24:35.796:自动阅卷尝试加写锁
		张虎成:75:2022-04-14 11:24:35.796:自动阅卷开始，写锁耗时3906
		陈云云:72:2022-04-14 11:24:36.984:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:72:2022-04-14 11:24:36.984:自动阅卷尝试加写锁
		张虎成:71:2022-04-14 11:24:36.984:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:71:2022-04-14 11:24:36.984:变更时间尝试加写锁
		张虎成:74:2022-04-14 11:24:37.640:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:74:2022-04-14 11:24:37.640:变更时间尝试加写锁
		张虎成:75:2022-04-14 11:24:37.765:自动阅卷完成，耗时1969
		张虎成:73:2022-04-14 11:24:37.765:答题开始，读锁耗时4750
		张虎成:75:2022-04-14 11:24:37.765:自动阅卷尝试加写锁
		陈云云:70:2022-04-14 11:24:37.765:答题开始，读锁耗时4515
		陈云云:70:2022-04-14 11:24:38.718:答题完成，答题耗时953毫秒
		陈云云:70:2022-04-14 11:24:38.718:答题尝试加读锁
		陈云云:68:2022-04-14 11:24:38.828:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:68:2022-04-14 11:24:38.828:变更时间尝试加写锁
		张虎成:67:2022-04-14 11:24:38.828:答题开始，读锁耗时4813
		张虎成:73:2022-04-14 11:24:38.859:答题完成，答题耗时1094毫秒
		车永强:73:2022-04-14 11:24:38.859:答题尝试加读锁
		张虎成:67:2022-04-14 11:24:40.031:答题完成，答题耗时1203毫秒
		张虎成:67:2022-04-14 11:24:40.031:答题尝试加读锁
		张虎成:69:2022-04-14 11:24:40.031:自动阅卷开始，写锁耗时4235
		陈云云:72:2022-04-14 11:24:41.984:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:72:2022-04-14 11:24:41.984:自动阅卷尝试加写锁
		张虎成:71:2022-04-14 11:24:41.984:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:71:2022-04-14 11:24:41.984:变更时间尝试加写锁
		张虎成:69:2022-04-14 11:24:42.484:自动阅卷完成，耗时2453
		陈云云:69:2022-04-14 11:24:42.484:自动阅卷尝试加写锁
		陈云云:69:2022-04-14 11:24:42.484:自动阅卷开始，写锁耗时0
		张虎成:74:2022-04-14 11:24:42.640:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:74:2022-04-14 11:24:42.640:变更时间尝试加写锁
		张虎成:75:2022-04-14 11:24:42.765:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:75:2022-04-14 11:24:42.765:自动阅卷尝试加写锁
		陈云云:70:2022-04-14 11:24:43.718:答题尝试加读锁失败，耗时5000毫秒
		陈云云:70:2022-04-14 11:24:43.718:答题尝试加读锁
		张虎成:68:2022-04-14 11:24:43.828:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:68:2022-04-14 11:24:43.828:变更时间尝试加写锁
		车永强:73:2022-04-14 11:24:43.859:答题尝试加读锁失败，耗时5000毫秒
		张虎成:73:2022-04-14 11:24:43.859:答题尝试加读锁
		陈云云:69:2022-04-14 11:24:44.609:自动阅卷完成，耗时2125
		张虎成:69:2022-04-14 11:24:44.609:自动阅卷尝试加写锁
		张虎成:69:2022-04-14 11:24:44.609:自动阅卷开始，写锁耗时0
		张虎成:67:2022-04-14 11:24:45.031:答题尝试加读锁失败，耗时5000毫秒
		车永强:67:2022-04-14 11:24:45.031:答题尝试加读锁
		陈云云:72:2022-04-14 11:24:46.984:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:72:2022-04-14 11:24:46.984:自动阅卷尝试加写锁
		张虎成:71:2022-04-14 11:24:46.984:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:71:2022-04-14 11:24:46.984:变更时间尝试加写锁
		张虎成:69:2022-04-14 11:24:47.406:自动阅卷完成，耗时2797
		陈云云:74:2022-04-14 11:24:47.406:变更时间开始，写锁耗时4766
		张虎成:69:2022-04-14 11:24:47.406:自动阅卷尝试加写锁
		陈云云:75:2022-04-14 11:24:47.765:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:75:2022-04-14 11:24:47.765:自动阅卷尝试加写锁
		陈云云:70:2022-04-14 11:24:48.718:答题尝试加读锁失败，耗时5000毫秒
		陈云云:70:2022-04-14 11:24:48.718:答题尝试加读锁
		张虎成:68:2022-04-14 11:24:48.828:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:68:2022-04-14 11:24:48.828:变更时间尝试加写锁
		张虎成:73:2022-04-14 11:24:48.859:答题尝试加读锁失败，耗时5000毫秒
		车永强:73:2022-04-14 11:24:48.859:答题尝试加读锁
		车永强:67:2022-04-14 11:24:50.031:答题尝试加读锁失败，耗时5000毫秒
		车永强:67:2022-04-14 11:24:50.031:答题尝试加读锁
		陈云云:74:2022-04-14 11:24:50.078:变更时间完成，耗时2672
		陈云云:74:2022-04-14 11:24:50.078:变更时间尝试加写锁
		陈云云:74:2022-04-14 11:24:50.078:变更时间开始，写锁耗时0
		陈云云:72:2022-04-14 11:24:51.984:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:72:2022-04-14 11:24:51.984:自动阅卷尝试加写锁
		陈云云:71:2022-04-14 11:24:52.000:变更时间尝试加写锁失败，耗时5016毫秒
		陈云云:71:2022-04-14 11:24:52.000:变更时间尝试加写锁
		张虎成:69:2022-04-14 11:24:52.406:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:69:2022-04-14 11:24:52.406:自动阅卷尝试加写锁
		陈云云:75:2022-04-14 11:24:52.765:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:75:2022-04-14 11:24:52.765:自动阅卷尝试加写锁
		陈云云:74:2022-04-14 11:24:52.968:变更时间完成，耗时2890
		陈云云:70:2022-04-14 11:24:52.968:答题开始，读锁耗时4250
		陈云云:74:2022-04-14 11:24:52.968:变更时间尝试加写锁
		陈云云:68:2022-04-14 11:24:53.843:变更时间尝试加写锁失败，耗时5015毫秒
		车永强:73:2022-04-14 11:24:53.843:答题开始，读锁耗时4984
		车永强:67:2022-04-14 11:24:53.843:答题开始，读锁耗时3812
		陈云云:68:2022-04-14 11:24:53.843:变更时间尝试加写锁
		陈云云:70:2022-04-14 11:24:53.984:答题完成，答题耗时1016毫秒
		陈云云:70:2022-04-14 11:24:53.984:答题尝试加读锁
		车永强:67:2022-04-14 11:24:54.640:答题完成，答题耗时797毫秒
		张虎成:67:2022-04-14 11:24:54.640:答题尝试加读锁
		车永强:73:2022-04-14 11:24:55.046:答题完成，答题耗时1203毫秒
		陈云云:73:2022-04-14 11:24:55.046:答题尝试加读锁
		陈云云:72:2022-04-14 11:24:55.046:自动阅卷开始，写锁耗时3062
		陈云云:72:2022-04-14 11:24:56.437:自动阅卷完成，耗时1391
		陈云云:72:2022-04-14 11:24:56.437:自动阅卷尝试加写锁
		陈云云:71:2022-04-14 11:24:56.437:变更时间开始，写锁耗时4437
		陈云云:69:2022-04-14 11:24:57.406:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:69:2022-04-14 11:24:57.406:自动阅卷尝试加写锁
		张虎成:75:2022-04-14 11:24:57.765:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:75:2022-04-14 11:24:57.765:自动阅卷尝试加写锁
		陈云云:74:2022-04-14 11:24:57.968:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:74:2022-04-14 11:24:57.968:变更时间尝试加写锁
		陈云云:68:2022-04-14 11:24:58.843:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:68:2022-04-14 11:24:58.843:变更时间尝试加写锁
		陈云云:70:2022-04-14 11:24:58.984:答题尝试加读锁失败，耗时5000毫秒
		张虎成:70:2022-04-14 11:24:58.984:答题尝试加读锁
		陈云云:71:2022-04-14 11:24:59.437:变更时间完成，耗时3000
		张虎成:67:2022-04-14 11:24:59.437:答题开始，读锁耗时4797
		陈云云:73:2022-04-14 11:24:59.437:答题开始，读锁耗时4391
		张虎成:71:2022-04-14 11:24:59.437:变更时间尝试加写锁
		陈云云:73:2022-04-14 11:25:00.640:答题完成，答题耗时1203毫秒
		车永强:73:2022-04-14 11:25:00.640:答题尝试加读锁
		张虎成:67:2022-04-14 11:25:00.656:答题完成，答题耗时1219毫秒
		陈云云:72:2022-04-14 11:25:00.656:自动阅卷开始，写锁耗时4219
		张虎成:67:2022-04-14 11:25:00.656:答题尝试加读锁
		陈云云:69:2022-04-14 11:25:02.406:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:69:2022-04-14 11:25:02.406:自动阅卷尝试加写锁
		张虎成:75:2022-04-14 11:25:02.765:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:75:2022-04-14 11:25:02.765:自动阅卷尝试加写锁
		陈云云:72:2022-04-14 11:25:02.859:自动阅卷完成，耗时2203
		张虎成:72:2022-04-14 11:25:02.859:自动阅卷尝试加写锁
		张虎成:72:2022-04-14 11:25:02.859:自动阅卷开始，写锁耗时0
		陈云云:74:2022-04-14 11:25:02.968:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:74:2022-04-14 11:25:02.968:变更时间尝试加写锁
		张虎成:68:2022-04-14 11:25:03.843:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:68:2022-04-14 11:25:03.843:变更时间尝试加写锁
		张虎成:70:2022-04-14 11:25:04.000:答题尝试加读锁失败，耗时5016毫秒
		陈云云:70:2022-04-14 11:25:04.000:答题尝试加读锁
		张虎成:72:2022-04-14 11:25:04.031:自动阅卷完成，耗时1172
		陈云云:72:2022-04-14 11:25:04.031:自动阅卷尝试加写锁
		陈云云:72:2022-04-14 11:25:04.031:自动阅卷开始，写锁耗时0
		张虎成:71:2022-04-14 11:25:04.437:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:71:2022-04-14 11:25:04.437:变更时间尝试加写锁
		车永强:73:2022-04-14 11:25:05.640:答题尝试加读锁失败，耗时5000毫秒
		陈云云:73:2022-04-14 11:25:05.640:答题尝试加读锁
		张虎成:67:2022-04-14 11:25:05.656:答题尝试加读锁失败，耗时5000毫秒
		车永强:67:2022-04-14 11:25:05.656:答题尝试加读锁
		陈云云:72:2022-04-14 11:25:05.875:自动阅卷完成，耗时1844
		张虎成:69:2022-04-14 11:25:05.875:自动阅卷开始，写锁耗时3469
		张虎成:72:2022-04-14 11:25:05.875:自动阅卷尝试加写锁
		张虎成:75:2022-04-14 11:25:07.765:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:75:2022-04-14 11:25:07.765:自动阅卷尝试加写锁
		张虎成:69:2022-04-14 11:25:07.812:自动阅卷完成，耗时1937
		张虎成:74:2022-04-14 11:25:07.812:变更时间开始，写锁耗时4844
		张虎成:69:2022-04-14 11:25:07.812:自动阅卷尝试加写锁
		陈云云:68:2022-04-14 11:25:08.843:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:68:2022-04-14 11:25:08.843:变更时间尝试加写锁
		陈云云:70:2022-04-14 11:25:09.000:答题尝试加读锁失败，耗时5000毫秒
		陈云云:70:2022-04-14 11:25:09.000:答题尝试加读锁
		张虎成:71:2022-04-14 11:25:09.437:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:71:2022-04-14 11:25:09.437:变更时间尝试加写锁
		张虎成:74:2022-04-14 11:25:10.625:变更时间完成，耗时2813
		陈云云:74:2022-04-14 11:25:10.625:变更时间尝试加写锁
		陈云云:74:2022-04-14 11:25:10.625:变更时间开始，写锁耗时0
		陈云云:73:2022-04-14 11:25:10.640:答题尝试加读锁失败，耗时5000毫秒
		车永强:73:2022-04-14 11:25:10.640:答题尝试加读锁
		车永强:67:2022-04-14 11:25:10.656:答题尝试加读锁失败，耗时5000毫秒
		车永强:67:2022-04-14 11:25:10.656:答题尝试加读锁
		张虎成:72:2022-04-14 11:25:10.875:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:72:2022-04-14 11:25:10.875:自动阅卷尝试加写锁
		张虎成:75:2022-04-14 11:25:12.765:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:75:2022-04-14 11:25:12.765:自动阅卷尝试加写锁
		张虎成:69:2022-04-14 11:25:12.812:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:69:2022-04-14 11:25:12.812:自动阅卷尝试加写锁
		陈云云:74:2022-04-14 11:25:13.625:变更时间完成，耗时3000
		张虎成:74:2022-04-14 11:25:13.625:变更时间尝试加写锁
		张虎成:74:2022-04-14 11:25:13.625:变更时间开始，写锁耗时0
		张虎成:68:2022-04-14 11:25:13.843:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:68:2022-04-14 11:25:13.843:变更时间尝试加写锁
		陈云云:70:2022-04-14 11:25:14.000:答题尝试加读锁失败，耗时5000毫秒
		车永强:70:2022-04-14 11:25:14.000:答题尝试加读锁
		陈云云:71:2022-04-14 11:25:14.437:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:71:2022-04-14 11:25:14.437:变更时间尝试加写锁
		张虎成:74:2022-04-14 11:25:15.562:变更时间完成，耗时1937
		陈云云:74:2022-04-14 11:25:15.562:变更时间尝试加写锁
		陈云云:74:2022-04-14 11:25:15.562:变更时间开始，写锁耗时0
		车永强:73:2022-04-14 11:25:15.640:答题尝试加读锁失败，耗时5000毫秒
		陈云云:73:2022-04-14 11:25:15.640:答题尝试加读锁
		车永强:67:2022-04-14 11:25:15.656:答题尝试加读锁失败，耗时5000毫秒
		张虎成:67:2022-04-14 11:25:15.656:答题尝试加读锁
		陈云云:72:2022-04-14 11:25:15.875:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:72:2022-04-14 11:25:15.875:自动阅卷尝试加写锁
		张虎成:75:2022-04-14 11:25:17.765:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:75:2022-04-14 11:25:17.765:自动阅卷尝试加写锁
		张虎成:69:2022-04-14 11:25:17.812:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:69:2022-04-14 11:25:17.812:自动阅卷尝试加写锁
		陈云云:74:2022-04-14 11:25:17.890:变更时间完成，耗时2328
		张虎成:74:2022-04-14 11:25:17.890:变更时间尝试加写锁
		张虎成:74:2022-04-14 11:25:17.890:变更时间开始，写锁耗时0
		陈云云:68:2022-04-14 11:25:18.843:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:68:2022-04-14 11:25:18.843:变更时间尝试加写锁
		车永强:70:2022-04-14 11:25:19.000:答题尝试加读锁失败，耗时5000毫秒
		陈云云:70:2022-04-14 11:25:19.000:答题尝试加读锁
		张虎成:71:2022-04-14 11:25:19.437:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:71:2022-04-14 11:25:19.437:变更时间尝试加写锁
		陈云云:73:2022-04-14 11:25:20.656:答题尝试加读锁失败，耗时5016毫秒
		陈云云:73:2022-04-14 11:25:20.656:答题尝试加读锁
		张虎成:67:2022-04-14 11:25:20.656:答题尝试加读锁失败，耗时5000毫秒
		陈云云:67:2022-04-14 11:25:20.656:答题尝试加读锁
		张虎成:74:2022-04-14 11:25:20.875:变更时间完成，耗时2985
		张虎成:74:2022-04-14 11:25:20.875:变更时间尝试加写锁
		张虎成:74:2022-04-14 11:25:20.875:变更时间开始，写锁耗时0
		张虎成:72:2022-04-14 11:25:20.875:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:72:2022-04-14 11:25:20.875:自动阅卷尝试加写锁
		张虎成:74:2022-04-14 11:25:22.015:变更时间完成，耗时1140
		张虎成:75:2022-04-14 11:25:22.015:自动阅卷开始，写锁耗时4250
		张虎成:74:2022-04-14 11:25:22.015:变更时间尝试加写锁
		张虎成:69:2022-04-14 11:25:22.812:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:69:2022-04-14 11:25:22.812:自动阅卷尝试加写锁
		张虎成:75:2022-04-14 11:25:23.062:自动阅卷完成，耗时1047
		张虎成:68:2022-04-14 11:25:23.062:变更时间开始，写锁耗时4219
		张虎成:75:2022-04-14 11:25:23.062:自动阅卷尝试加写锁
		陈云云:70:2022-04-14 11:25:24.000:答题尝试加读锁失败，耗时5000毫秒
		张虎成:70:2022-04-14 11:25:24.000:答题尝试加读锁
		张虎成:71:2022-04-14 11:25:24.437:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:71:2022-04-14 11:25:24.437:变更时间尝试加写锁
		张虎成:68:2022-04-14 11:25:25.343:变更时间完成，耗时2281
		张虎成:68:2022-04-14 11:25:25.343:变更时间尝试加写锁
		张虎成:68:2022-04-14 11:25:25.343:变更时间开始，写锁耗时0
		陈云云:73:2022-04-14 11:25:25.656:答题尝试加读锁失败，耗时5000毫秒
		车永强:73:2022-04-14 11:25:25.656:答题尝试加读锁
		陈云云:67:2022-04-14 11:25:25.656:答题尝试加读锁失败，耗时5000毫秒
		张虎成:67:2022-04-14 11:25:25.656:答题尝试加读锁
		陈云云:72:2022-04-14 11:25:25.890:自动阅卷尝试加写锁失败，耗时5015毫秒
		张虎成:72:2022-04-14 11:25:25.890:自动阅卷尝试加写锁
		张虎成:74:2022-04-14 11:25:27.015:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:74:2022-04-14 11:25:27.015:变更时间尝试加写锁
		张虎成:68:2022-04-14 11:25:27.250:变更时间完成，耗时1907
		陈云云:68:2022-04-14 11:25:27.250:变更时间尝试加写锁
		陈云云:69:2022-04-14 11:25:27.250:自动阅卷开始，写锁耗时4438
		张虎成:75:2022-04-14 11:25:28.062:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:75:2022-04-14 11:25:28.062:自动阅卷尝试加写锁
		张虎成:70:2022-04-14 11:25:29.000:答题尝试加读锁失败，耗时5000毫秒
		陈云云:70:2022-04-14 11:25:29.000:答题尝试加读锁
		陈云云:71:2022-04-14 11:25:29.437:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:71:2022-04-14 11:25:29.437:变更时间尝试加写锁
		陈云云:69:2022-04-14 11:25:30.093:自动阅卷完成，耗时2843
		张虎成:69:2022-04-14 11:25:30.093:自动阅卷尝试加写锁
		张虎成:69:2022-04-14 11:25:30.093:自动阅卷开始，写锁耗时0
		车永强:73:2022-04-14 11:25:30.656:答题尝试加读锁失败，耗时5000毫秒
		车永强:73:2022-04-14 11:25:30.656:答题尝试加读锁
		张虎成:67:2022-04-14 11:25:30.656:答题尝试加读锁失败，耗时5000毫秒
		车永强:67:2022-04-14 11:25:30.656:答题尝试加读锁
		张虎成:72:2022-04-14 11:25:30.890:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:72:2022-04-14 11:25:30.890:自动阅卷尝试加写锁
		陈云云:74:2022-04-14 11:25:32.015:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:74:2022-04-14 11:25:32.015:变更时间尝试加写锁
		陈云云:68:2022-04-14 11:25:32.250:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:68:2022-04-14 11:25:32.250:变更时间尝试加写锁
		张虎成:69:2022-04-14 11:25:32.265:自动阅卷完成，耗时2172
		张虎成:69:2022-04-14 11:25:32.265:自动阅卷尝试加写锁
		陈云云:75:2022-04-14 11:25:32.265:自动阅卷开始，写锁耗时4203
		陈云云:70:2022-04-14 11:25:34.000:答题尝试加读锁失败，耗时5000毫秒
		车永强:70:2022-04-14 11:25:34.000:答题尝试加读锁
		陈云云:75:2022-04-14 11:25:34.359:自动阅卷完成，耗时2094
		张虎成:75:2022-04-14 11:25:34.359:自动阅卷尝试加写锁
		张虎成:71:2022-04-14 11:25:34.359:变更时间开始，写锁耗时4922
		车永强:73:2022-04-14 11:25:35.656:答题尝试加读锁失败，耗时5000毫秒
		张虎成:73:2022-04-14 11:25:35.656:答题尝试加读锁
		车永强:67:2022-04-14 11:25:35.656:答题尝试加读锁失败，耗时5000毫秒
		陈云云:67:2022-04-14 11:25:35.656:答题尝试加读锁
		张虎成:72:2022-04-14 11:25:35.890:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:72:2022-04-14 11:25:35.890:自动阅卷尝试加写锁
		张虎成:71:2022-04-14 11:25:35.968:变更时间完成，耗时1609
		陈云云:74:2022-04-14 11:25:35.968:变更时间开始，写锁耗时3953
		陈云云:71:2022-04-14 11:25:35.968:变更时间尝试加写锁
		陈云云:68:2022-04-14 11:25:37.250:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:68:2022-04-14 11:25:37.250:变更时间尝试加写锁
		张虎成:69:2022-04-14 11:25:37.281:自动阅卷尝试加写锁失败，耗时5016毫秒
		张虎成:69:2022-04-14 11:25:37.281:自动阅卷尝试加写锁
		陈云云:74:2022-04-14 11:25:37.500:变更时间完成，耗时1532
		车永强:70:2022-04-14 11:25:37.500:答题开始，读锁耗时3500
		陈云云:74:2022-04-14 11:25:37.500:变更时间尝试加写锁
		车永强:70:2022-04-14 11:25:38.500:答题完成，答题耗时1000毫秒
		车永强:70:2022-04-14 11:25:38.500:答题尝试加读锁
		张虎成:75:2022-04-14 11:25:38.500:自动阅卷开始，写锁耗时4141
		张虎成:75:2022-04-14 11:25:39.593:自动阅卷完成，耗时1093
		张虎成:75:2022-04-14 11:25:39.593:自动阅卷尝试加写锁
		张虎成:75:2022-04-14 11:25:39.593:自动阅卷开始，写锁耗时0
		张虎成:75:2022-04-14 11:25:40.593:自动阅卷完成，耗时1000
		陈云云:75:2022-04-14 11:25:40.593:自动阅卷尝试加写锁
		陈云云:75:2022-04-14 11:25:40.593:自动阅卷开始，写锁耗时0
		张虎成:73:2022-04-14 11:25:40.656:答题尝试加读锁失败，耗时5000毫秒
		车永强:73:2022-04-14 11:25:40.656:答题尝试加读锁
		陈云云:67:2022-04-14 11:25:40.656:答题尝试加读锁失败，耗时5000毫秒
		车永强:67:2022-04-14 11:25:40.656:答题尝试加读锁
		陈云云:72:2022-04-14 11:25:40.890:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:72:2022-04-14 11:25:40.890:自动阅卷尝试加写锁
		陈云云:71:2022-04-14 11:25:40.968:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:71:2022-04-14 11:25:40.968:变更时间尝试加写锁
		陈云云:75:2022-04-14 11:25:42.000:自动阅卷完成，耗时1407
		张虎成:68:2022-04-14 11:25:42.000:变更时间开始，写锁耗时4750
		陈云云:75:2022-04-14 11:25:42.000:自动阅卷尝试加写锁
		张虎成:69:2022-04-14 11:25:42.281:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:69:2022-04-14 11:25:42.281:自动阅卷尝试加写锁
		陈云云:74:2022-04-14 11:25:42.500:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:74:2022-04-14 11:25:42.500:变更时间尝试加写锁
		车永强:70:2022-04-14 11:25:43.500:答题尝试加读锁失败，耗时5000毫秒
		张虎成:70:2022-04-14 11:25:43.500:答题尝试加读锁
		张虎成:68:2022-04-14 11:25:43.687:变更时间完成，耗时1687
		张虎成:68:2022-04-14 11:25:43.687:变更时间尝试加写锁
		车永强:67:2022-04-14 11:25:43.687:答题开始，读锁耗时3031
		车永强:73:2022-04-14 11:25:43.687:答题开始，读锁耗时3031
		车永强:73:2022-04-14 11:25:44.500:答题完成，答题耗时813毫秒
		张虎成:73:2022-04-14 11:25:44.500:答题尝试加读锁
		车永强:67:2022-04-14 11:25:44.875:答题完成，答题耗时1188毫秒
		陈云云:72:2022-04-14 11:25:44.875:自动阅卷开始，写锁耗时3985
		陈云云:67:2022-04-14 11:25:44.875:答题尝试加读锁
		张虎成:71:2022-04-14 11:25:45.968:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:71:2022-04-14 11:25:45.968:变更时间尝试加写锁
		陈云云:75:2022-04-14 11:25:47.000:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:75:2022-04-14 11:25:47.000:自动阅卷尝试加写锁
		陈云云:69:2022-04-14 11:25:47.281:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:69:2022-04-14 11:25:47.281:自动阅卷尝试加写锁
		陈云云:74:2022-04-14 11:25:47.500:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:74:2022-04-14 11:25:47.500:变更时间尝试加写锁
		陈云云:72:2022-04-14 11:25:47.859:自动阅卷完成，耗时2984
		张虎成:72:2022-04-14 11:25:47.859:自动阅卷尝试加写锁
		张虎成:72:2022-04-14 11:25:47.859:自动阅卷开始，写锁耗时0
		张虎成:70:2022-04-14 11:25:48.500:答题尝试加读锁失败，耗时5000毫秒
		车永强:70:2022-04-14 11:25:48.500:答题尝试加读锁
		张虎成:68:2022-04-14 11:25:48.687:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:68:2022-04-14 11:25:48.687:变更时间尝试加写锁
		张虎成:72:2022-04-14 11:25:49.187:自动阅卷完成，耗时1328
		张虎成:73:2022-04-14 11:25:49.187:答题开始，读锁耗时4687
		陈云云:67:2022-04-14 11:25:49.187:答题开始，读锁耗时4312
		张虎成:72:2022-04-14 11:25:49.187:自动阅卷尝试加写锁
		张虎成:73:2022-04-14 11:25:50.265:答题完成，答题耗时1078毫秒
		陈云云:73:2022-04-14 11:25:50.265:答题尝试加读锁
		陈云云:67:2022-04-14 11:25:50.343:答题完成，答题耗时1156毫秒
		陈云云:67:2022-04-14 11:25:50.343:答题尝试加读锁
		张虎成:71:2022-04-14 11:25:50.343:变更时间开始，写锁耗时4375
		陈云云:75:2022-04-14 11:25:52.015:自动阅卷尝试加写锁失败，耗时5015毫秒
		陈云云:75:2022-04-14 11:25:52.015:自动阅卷尝试加写锁
		陈云云:69:2022-04-14 11:25:52.281:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:69:2022-04-14 11:25:52.281:自动阅卷尝试加写锁
		张虎成:74:2022-04-14 11:25:52.500:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:74:2022-04-14 11:25:52.500:变更时间尝试加写锁
		张虎成:71:2022-04-14 11:25:52.781:变更时间完成，耗时2438
		陈云云:71:2022-04-14 11:25:52.781:变更时间尝试加写锁
		车永强:70:2022-04-14 11:25:52.781:答题开始，读锁耗时4281
		张虎成:68:2022-04-14 11:25:53.687:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:68:2022-04-14 11:25:53.687:变更时间尝试加写锁
		车永强:70:2022-04-14 11:25:54.031:答题完成，答题耗时1250毫秒
		车永强:70:2022-04-14 11:25:54.031:答题尝试加读锁
		张虎成:72:2022-04-14 11:25:54.031:自动阅卷开始，写锁耗时4844
		张虎成:72:2022-04-14 11:25:55.093:自动阅卷完成，耗时1062
		陈云云:73:2022-04-14 11:25:55.093:答题开始，读锁耗时4828
		陈云云:67:2022-04-14 11:25:55.093:答题开始，读锁耗时4750
		张虎成:72:2022-04-14 11:25:55.093:自动阅卷尝试加写锁
		陈云云:73:2022-04-14 11:25:56.312:答题完成，答题耗时1219毫秒
		车永强:73:2022-04-14 11:25:56.312:答题尝试加读锁
		陈云云:67:2022-04-14 11:25:56.343:答题完成，答题耗时1250毫秒
		陈云云:67:2022-04-14 11:25:56.343:答题尝试加读锁
		陈云云:75:2022-04-14 11:25:56.343:自动阅卷开始，写锁耗时4328
		陈云云:69:2022-04-14 11:25:57.281:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:69:2022-04-14 11:25:57.281:自动阅卷尝试加写锁
		陈云云:74:2022-04-14 11:25:57.500:变更时间尝试加写锁失败，耗时5000毫秒
		张虎成:74:2022-04-14 11:25:57.500:变更时间尝试加写锁
		陈云云:71:2022-04-14 11:25:57.796:变更时间尝试加写锁失败，耗时5015毫秒
		陈云云:71:2022-04-14 11:25:57.796:变更时间尝试加写锁
		陈云云:68:2022-04-14 11:25:58.687:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:68:2022-04-14 11:25:58.687:变更时间尝试加写锁
		陈云云:75:2022-04-14 11:25:58.718:自动阅卷完成，耗时2375
		张虎成:75:2022-04-14 11:25:58.718:自动阅卷尝试加写锁
		车永强:70:2022-04-14 11:25:58.718:答题开始，读锁耗时4687
		车永强:73:2022-04-14 11:26:00.093:答题开始，读锁耗时3781
		陈云云:67:2022-04-14 11:26:00.093:答题开始，读锁耗时3750
		张虎成:72:2022-04-14 11:26:00.093:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:72:2022-04-14 11:26:00.093:自动阅卷尝试加写锁
		车永强:70:2022-04-14 11:26:00.171:答题完成，答题耗时1453毫秒
		陈云云:70:2022-04-14 11:26:00.171:答题尝试加读锁
		陈云云:67:2022-04-14 11:26:01.203:答题完成，答题耗时1110毫秒
		陈云云:67:2022-04-14 11:26:01.203:答题尝试加读锁
		车永强:73:2022-04-14 11:26:01.234:答题完成，答题耗时1141毫秒
		陈云云:73:2022-04-14 11:26:01.234:答题尝试加读锁
		陈云云:69:2022-04-14 11:26:01.234:自动阅卷开始，写锁耗时3953
		张虎成:74:2022-04-14 11:26:02.500:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:74:2022-04-14 11:26:02.500:变更时间尝试加写锁
		陈云云:71:2022-04-14 11:26:02.796:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:71:2022-04-14 11:26:02.796:变更时间尝试加写锁
		陈云云:69:2022-04-14 11:26:03.015:自动阅卷完成，耗时1781
		张虎成:69:2022-04-14 11:26:03.015:自动阅卷尝试加写锁
		陈云云:68:2022-04-14 11:26:03.015:变更时间开始，写锁耗时4328
		张虎成:75:2022-04-14 11:26:03.718:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:75:2022-04-14 11:26:03.718:自动阅卷尝试加写锁
		张虎成:72:2022-04-14 11:26:05.093:自动阅卷尝试加写锁失败，耗时5000毫秒
		张虎成:72:2022-04-14 11:26:05.093:自动阅卷尝试加写锁
		陈云云:70:2022-04-14 11:26:05.171:答题尝试加读锁失败，耗时5000毫秒
		陈云云:70:2022-04-14 11:26:05.171:答题尝试加读锁
		陈云云:68:2022-04-14 11:26:05.437:变更时间完成，耗时2422
		陈云云:73:2022-04-14 11:26:05.437:答题开始，读锁耗时4203
		陈云云:68:2022-04-14 11:26:05.437:变更时间尝试加写锁
		陈云云:67:2022-04-14 11:26:05.437:答题开始，读锁耗时4234
		陈云云:73:2022-04-14 11:26:06.578:答题完成，答题耗时1141毫秒
		陈云云:73:2022-04-14 11:26:06.578:答题尝试加读锁
		陈云云:67:2022-04-14 11:26:06.843:答题完成，答题耗时1406毫秒
		陈云云:74:2022-04-14 11:26:06.843:变更时间开始，写锁耗时4343
		车永强:67:2022-04-14 11:26:06.843:答题尝试加读锁
		陈云云:71:2022-04-14 11:26:07.796:变更时间尝试加写锁失败，耗时5000毫秒
		陈云云:71:2022-04-14 11:26:07.796:变更时间尝试加写锁
		陈云云:74:2022-04-14 11:26:08.000:变更时间完成，耗时1157
		张虎成:69:2022-04-14 11:26:08.000:自动阅卷开始，写锁耗时4985
		张虎成:74:2022-04-14 11:26:08.000:变更时间尝试加写锁
		陈云云:75:2022-04-14 11:26:08.718:自动阅卷尝试加写锁失败，耗时5000毫秒
		陈云云:75:2022-04-14 11:26:08.718:自动阅卷尝试加写锁
	 * 
	 */
}
